notes/emacs.org
#+author: Florent Espanet
#+date: <2022-03-28 lun. 13:38>
#+title: Emacs configuration
#+html_link_home: /
#+html_link_up: /notes/
#+property: header-args :tangle ~/.emacs.d/init.el
#+property: header-args :exports code

* Emacs configuration
Source for my Emacs configuration. The init.el file can be generated from this org file using ~org-babel-tangle~ ([[https://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming-example][reference]]).

** Boostrap straight.el
Use [[https://github.com/raxod502/straight.el][straight.el]] with the ~use-package~ form to install and manage emacs packages.

#+begin_src elisp
;; Disable emacs default package.el (in favor of straight.el)
(setq package-enable-at-startup nil)

;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package) ;; Use the use-package form to install define packages

(use-package straight
  :custom (straight-use-package-by-default t)) ;; Make :straight t the default to ensure packages are installed
#+end_src

** Custom file location
Set the custom file location.

#+begin_src elisp
;; Set custom file location
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)
#+end_src

** Update defaults
Update a few defaults like the menu-bar, scroll-bar etc.
#+begin_src elisp
;; Remove menu, scroll bars and other visual things
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(setq column-number-mode nil)
(setq line-number-mode nil)
(setq size-indication-mode nil)
(setq inhibit-startup-screen t)
(setq mouse-yank-at-point t)
(setq-default indent-tabs-mode nil)

(global-display-line-numbers-mode t)

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(add-hook 'before-save-hook 'delete-trailing-whitespace)
#+end_src

#+RESULTS:
| py-isort-before-save | delete-trailing-whitespace |

