notes/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs configuration</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/css/org.css" /> <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.1/css/brands.min.css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/notes/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Emacs configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7701c3c">Emacs configuration</a>
<ul>
<li><a href="#org23af662">Boostrap straight.el</a></li>
<li><a href="#org2394b6b">Custom file location</a></li>
<li><a href="#org15a1e59">Update defaults</a></li>
<li><a href="#org6d59944">Org-mode</a></li>
<li><a href="#org432ed17">Install major modes</a></li>
<li><a href="#org7e07c4a">Theme</a></li>
<li><a href="#orgd95c04d">UI</a></li>
<li><a href="#orgd8c651b">Utilities</a>
<ul>
<li><a href="#org298c393">Vterm</a></li>
</ul>
</li>
<li><a href="#orgbc6e22c">Python setup</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7701c3c" class="outline-2">
<h2 id="org7701c3c">Emacs configuration</h2>
<div class="outline-text-2" id="text-org7701c3c">
<p>
Source for my Emacs configuration. The init.el file can be generated from this org file using <code>org-babel-tangle</code> (<a href="https://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming-example">reference</a>).
</p>
</div>

<div id="outline-container-org23af662" class="outline-3">
<h3 id="org23af662">Boostrap straight.el</h3>
<div class="outline-text-3" id="text-org23af662">
<p>
Use <a href="https://github.com/raxod502/straight.el">straight.el</a> with the <code>use-package</code> form to install and manage emacs packages.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Disable emacs default package.el (in favor of straight.el)</span>
(<span class="org-keyword">setq</span> package-enable-at-startup nil)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Bootstrap straight.el</span>
(<span class="org-keyword">defvar</span> <span class="org-variable-name">bootstrap-version</span>)
(<span class="org-keyword">let</span> ((bootstrap-file
       (expand-file-name <span class="org-string">"straight/repos/straight.el/bootstrap.el"</span> user-emacs-directory))
      (bootstrap-version 5))
  (<span class="org-keyword">unless</span> (file-exists-p bootstrap-file)
    (<span class="org-keyword">with-current-buffer</span>
        (url-retrieve-synchronously
         <span class="org-string">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package) <span class="org-comment-delimiter">;; </span><span class="org-comment">Use the use-package form to install define packages</span>

(use-package straight
  <span class="org-builtin">:custom</span> (straight-use-package-by-default t)) <span class="org-comment-delimiter">;; </span><span class="org-comment">Make :straight t the default to ensure packages are installed</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2394b6b" class="outline-3">
<h3 id="org2394b6b">Custom file location</h3>
<div class="outline-text-3" id="text-org2394b6b">
<p>
Set the custom file location.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Set custom file location</span>
(<span class="org-keyword">setq</span> custom-file <span class="org-string">"~/.emacs.d/custom.el"</span>)
(load custom-file)
</pre>
</div>
</div>
</div>

<div id="outline-container-org15a1e59" class="outline-3">
<h3 id="org15a1e59">Update defaults</h3>
<div class="outline-text-3" id="text-org15a1e59">
<p>
Update a few defaults like the menu-bar, scroll-bar etc.
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Remove menu, scroll bars and other visual things</span>
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(<span class="org-keyword">setq</span> column-number-mode nil)
(<span class="org-keyword">setq</span> line-number-mode nil)
(<span class="org-keyword">setq</span> size-indication-mode nil)
(<span class="org-keyword">setq</span> inhibit-startup-screen t)
(<span class="org-keyword">setq</span> mouse-yank-at-point t)
(<span class="org-keyword">setq-default</span> indent-tabs-mode nil)

(global-display-line-numbers-mode t)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Disable line numbers for some modes</span>
(<span class="org-keyword">dolist</span> (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (<span class="org-keyword">lambda</span> () (display-line-numbers-mode 0))))

(add-hook 'before-save-hook 'delete-trailing-whitespace)
</pre>
</div>
</div>
</div>
