notes/emacs.org
** Org-mode
I use org-mode to organize my tasks, edit this website and write meeting notes and keep some long-term documentation.

I have a few different files for tasks and I like to clean them up by removing old DONE tasks. My exact workflow is that I have a recurrent tasks every two weeks that reminds me to refile DONE tasks older than two weeks to an =archive.org= file.

To automate this, a few custom functions are needed to find DONE tasks older than two weeks. (source: [[https://stackoverflow.com/a/8186450]])


#+begin_src elisp
(defun zin/since-state (since todo-state &optional done all)
  "List Agenda items that are older than SINCE.

TODO-STATE is a regexp for matching to TODO states.  It is provided to
`zin/find-state' to match inactive timestamps.
SINCE is compared to the result of `zin/org-date-diff'.  If
`zin/org-date-diff' is greater than SINCE, the entry is shown in the
Agenda.
Optional argument DONE allows for done and not-done headlines to be
evaluated.  If DONE is non-nil, match completed tasks.
Optional argument ALL is passed to `zin/find-state' to specify whether
to search for any possible match of STATE, or only in the most recent
log entry."
  (let ((next-headline (save-excursion (or (outline-next-heading) (point-max)))))
    ;; If DONE is non-nil, look for done keywords, if nil look for not-done
    (if (member (org-get-todo-state)
                (if done
                    org-done-keywords
                  org-not-done-keywords))
        (let* ((subtree-end (save-excursion (org-end-of-subtree t)))
               (subtree-valid (save-excursion
                               (forward-line 1)
                               (if (and (< (point) subtree-end)
                                        ;; Find the timestamp to test
                                        (zin/find-state todo-state subtree-end all))
                                   (let ((startpoint (point)))
                                     (forward-word 3)
                                     ;; Convert timestamp into days difference from today
                                     (zin/org-date-diff startpoint (point)))))))
          (if (or (not subtree-valid)
                  (<= subtree-valid since))
              next-headline
            nil))
      (or next-headline (point-max)))))

(defun zin/find-state (state &optional end all)
  "Used to search through the logbook of subtrees.

Tests to see if the first line of the logbook is a change of todo
status to status STATE
- Status \"STATE\" from ...
The search brings the point to the start of YYYY-MM-DD in inactive timestamps.

Optional argument END defines the point at which to stop searching.
Optional argument ALL when non-nil specifies to look for any occurence
of STATE in the subtree, not just in the most recent entry."
  (let ((drawer (if all "" ":.*:\\W" "CLOSED:")))
    (or (re-search-forward (concat drawer ".*State \\\"" state "\\\"\\W+from.*\\[") end t)
        (re-search-forward (concat drawer ".*\\[") end t))))

(defun zin/org-date-diff (start end &optional compare)
  "Calculate difference between  selected timestamp to current date.

The difference between the dates is calculated in days.
START and END define the region within which the timestamp is found.
Optional argument COMPARE allows for comparison to a specific date rather than to current date."
  (let* ((start-date (if compare compare (calendar-current-date))))
    (- (calendar-absolute-from-gregorian start-date) (org-time-string-to-absolute (buffer-substring-no-properties start end)))
    ))
#+end_src

In the org-mode configuration you can see references to files that are not part of this repository. The =org-agenda-files= and the =org-capture-templates= templates.

I use capture templates to create new notes / recipes on this website. Each page is a different org file and for recipes there's a common template.

There's also the =org-agenda-custom-commands= that uses the previously defined functions to refiles old DONE tasks.

#+begin_src elisp
(use-package org
  :bind (("C-c a" . org-agenda-list)
         ("C-c l" . org-store-link)
         ("C-c c" . org-capture))
  :hook
  (org-mode . org-indent-mode)
  (org-mode . visual-line-mode)
  :config
  (setq org-html-doctype "html5" ;; HTML export

        ;; Visual tweaks
        org-hide-emphasis-markers t
        org-ellipsis " ▼ "

        ;; Startup
        org-startup-with-inline-images t
        org-startup-folded "showeverything"
        org-startup-indented t

        ;; Babel
        org-babel-min-lines-for-block-output 1
        org-confirm-babel-evaluate nil
        org-src-preserve-indentation t

        ;; Fontify
        org-fontify-done-headline t
        org-src-fontify-natively t

        ;; Agenda
        org-agenda-start-with-log-mode t
        org-log-done 'time
        org-agenda-skip-scheduled-if-done t
        org-log-into-drawer t
        org-agenda-files '("~/org/work.org" "~/org/keep.org" "~/org/house.org" "~/org/perso.org")

        org-agenda-custom-commands '(("R" "Tasks that were completed more than 14 days ago." tags "-REFILE/"
               ((org-agenda-files '("~/org/work.org" "~/org/perso.org" "~/org/house.org"))
                (org-agenda-overriding-header "Archivable tasks")
                (org-agenda-skip-function '(zin/since-state 14 "\\\(DONE\\\|CANC\\\)" t)))))



        ;; Refiling
        org-refile-targets '(("~/org/archives.org" :maxlevel . 1)))

  (advice-add 'org-refile :after 'org-save-all-org-buffers)

  (setq org-todo-keywords
        '((sequence "TODO(t!)" "|" "DONE(d!)")))

  (setq org-capture-templates
        '(("s" "Site Entries")
          ("sr" "Recipe" plain
           (file (lambda () (expand-file-name (read-string "Filename: ") "~/dev/volnt.github.io/recipes/")))
           (file "~/org/templates/recipe.org"))
          ("sn" "Note" plain
           (file (lambda () (expand-file-name (read-string "Filename: ") "~/dev/volnt.github.io/notes/"))))
          ("t" "Todo Entries")
          ("tt" "Todo" entry (file "~/org/perso.org")
           "* TODO %?\n%U\n%i" :empty-lines 1)
          ("th" "House entry." entry (file "~/org/house.org")
           "* TODO %? :house:\n%U\n%i" :empty-lines 1)
          ("tw" "Work entry." entry (file "~/org/work.org")
           "* TODO %? :work:\n%U\n%i" :empty-lines 1)
          ("m" "Meeting Entries")
          ("mm" "Meeting" entry (file "~/org/perso.org")
           "* %? :meeting:\n%U\n%i" :clock-in :clock-resume :empty-lines 1)
          ("mw" "Work Meeting" entry (file "~/org/work.org")
           "* %? :work:meeting:\n%U\n%i" :clock-in :clock-resume :empty-lines 1)
          ("mo" "One-to-One" entry (file+headline "~/org/work.org" "One-to-one")
           "* TODO %? :work:meeting:\n%U\n%i" :clock-in :clock-resume :empty-lines 1)
          ("mt" "Tech Screening" entry (file "~/org/work.org")
           (file "~/org/templates/tech-screening.org") :clock-in :clock-resume :empty-lines 1)
          ("ml" "ML Interview" entry (file "~/org/work.org")
           (file "~/org/templates/ml-engineer-screening.org") :clock-in :clock-resume :empty-lines 1)))

  (org-babel-do-load-languages
   'org-babel-load-languages '((python . t) (shell . t) (C . t) (gnuplot . t)))
  (use-package org-superstar
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●")))
  (use-package epresent)
  (use-package ox-jira)
  (straight-use-package '(org-contrib :includes org-checklist))
  (load "org-checklist"))
#+end_src


#+RESULTS:
#+begin_example
org-capture
#+end_example

