notes/emacs.html

<div id="outline-container-org6d59944" class="outline-3">
<h3 id="org6d59944">Org-mode</h3>
<div class="outline-text-3" id="text-org6d59944">
<p>
I use org-mode to organize my tasks, edit this website and write meeting notes and keep some long-term documentation.
</p>

<p>
I have a few different files for tasks and I like to clean them up by removing old DONE tasks. My exact workflow is that I have a recurrent tasks every two weeks that reminds me to refile DONE tasks older than two weeks to an <code>archive.org</code> file.
</p>

<p>
To automate this, a few custom functions are needed to find DONE tasks older than two weeks. (source: <a href="https://stackoverflow.com/a/8186450">https://stackoverflow.com/a/8186450</a>)
</p>


<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">defun</span> <span class="org-function-name">zin/since-state</span> (since todo-state <span class="org-type">&amp;optional</span> done all)
  <span class="org-doc">"List Agenda items that are older than SINCE.</span>

<span class="org-doc">TODO-STATE is a regexp for matching to TODO states.  It is provided to</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">zin/find-state</span></span><span class="org-doc">' to match inactive timestamps.</span>
<span class="org-doc">SINCE is compared to the result of `</span><span class="org-doc"><span class="org-constant">zin/org-date-diff</span></span><span class="org-doc">'.  If</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">zin/org-date-diff</span></span><span class="org-doc">' is greater than SINCE, the entry is shown in the</span>
<span class="org-doc">Agenda.</span>
<span class="org-doc">Optional argument DONE allows for done and not-done headlines to be</span>
<span class="org-doc">evaluated.  If DONE is non-nil, match completed tasks.</span>
<span class="org-doc">Optional argument ALL is passed to `</span><span class="org-doc"><span class="org-constant">zin/find-state</span></span><span class="org-doc">' to specify whether</span>
<span class="org-doc">to search for any possible match of STATE, or only in the most recent</span>
<span class="org-doc">log entry."</span>
  (<span class="org-keyword">let</span> ((next-headline (<span class="org-keyword">save-excursion</span> (<span class="org-keyword">or</span> (outline-next-heading) (point-max)))))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">If DONE is non-nil, look for done keywords, if nil look for not-done</span>
    (<span class="org-keyword">if</span> (member (org-get-todo-state)
                (<span class="org-keyword">if</span> done
                    org-done-keywords
                  org-not-done-keywords))
        (<span class="org-keyword">let*</span> ((subtree-end (<span class="org-keyword">save-excursion</span> (org-end-of-subtree t)))
               (subtree-valid (<span class="org-keyword">save-excursion</span>
                               (forward-line 1)
                               (<span class="org-keyword">if</span> (<span class="org-keyword">and</span> (&lt; (point) subtree-end)
                                        <span class="org-comment-delimiter">;; </span><span class="org-comment">Find the timestamp to test</span>
                                        (zin/find-state todo-state subtree-end all))
                                   (<span class="org-keyword">let</span> ((startpoint (point)))
                                     (forward-word 3)
                                     <span class="org-comment-delimiter">;; </span><span class="org-comment">Convert timestamp into days difference from today</span>
                                     (zin/org-date-diff startpoint (point)))))))
          (<span class="org-keyword">if</span> (<span class="org-keyword">or</span> (not subtree-valid)
                  (&lt;= subtree-valid since))
              next-headline
            nil))
      (<span class="org-keyword">or</span> next-headline (point-max)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">zin/find-state</span> (state <span class="org-type">&amp;optional</span> end all)
  <span class="org-doc">"Used to search through the logbook of subtrees.</span>

<span class="org-doc">Tests to see if the first line of the logbook is a change of todo</span>
<span class="org-doc">status to status STATE</span>
<span class="org-doc">- Status \"STATE\" from ...</span>
<span class="org-doc">The search brings the point to the start of YYYY-MM-DD in inactive timestamps.</span>

<span class="org-doc">Optional argument END defines the point at which to stop searching.</span>
<span class="org-doc">Optional argument ALL when non-nil specifies to look for any occurence</span>
<span class="org-doc">of STATE in the subtree, not just in the most recent entry."</span>
  (<span class="org-keyword">let</span> ((drawer (<span class="org-keyword">if</span> all <span class="org-string">""</span> <span class="org-string">":.*:\\W"</span> <span class="org-string">"CLOSED:"</span>)))
    (<span class="org-keyword">or</span> (re-search-forward (concat drawer <span class="org-string">".*State \\\""</span> state <span class="org-string">"\\\"\\W+from.*\\["</span>) end t)
        (re-search-forward (concat drawer <span class="org-string">".*\\["</span>) end t))))

(<span class="org-keyword">defun</span> <span class="org-function-name">zin/org-date-diff</span> (start end <span class="org-type">&amp;optional</span> compare)
  <span class="org-doc">"Calculate difference between  selected timestamp to current date.</span>

<span class="org-doc">The difference between the dates is calculated in days.</span>
<span class="org-doc">START and END define the region within which the timestamp is found.</span>
<span class="org-doc">Optional argument COMPARE allows for comparison to a specific date rather than to current date."</span>
  (<span class="org-keyword">let*</span> ((start-date (<span class="org-keyword">if</span> compare compare (calendar-current-date))))
    (- (calendar-absolute-from-gregorian start-date) (org-time-string-to-absolute (buffer-substring-no-properties start end)))
    ))
</pre>
</div>

<p>
In the org-mode configuration you can see references to files that are not part of this repository. The <code>org-agenda-files</code> and the <code>org-capture-templates</code> templates.
</p>

<p>
I use capture templates to create new notes / recipes on this website. Each page is a different org file and for recipes there's a common template.
</p>

<p>
There's also the <code>org-agenda-custom-commands</code> that uses the previously defined functions to refiles old DONE tasks.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package org
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c a"</span> . org-agenda-list)
         (<span class="org-string">"C-c l"</span> . org-store-link)
         (<span class="org-string">"C-c c"</span> . org-capture))
  <span class="org-builtin">:hook</span>
  (org-mode . org-indent-mode)
  (org-mode . visual-line-mode)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> org-html-doctype <span class="org-string">"html5"</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">HTML export</span>

        <span class="org-comment-delimiter">;; </span><span class="org-comment">Visual tweaks</span>
        org-hide-emphasis-markers t
        org-ellipsis <span class="org-string">" &#9660; "</span>

        <span class="org-comment-delimiter">;; </span><span class="org-comment">Startup</span>
        org-startup-with-inline-images t
        org-startup-folded <span class="org-string">"showeverything"</span>
        org-startup-indented t

        <span class="org-comment-delimiter">;; </span><span class="org-comment">Babel</span>
        org-babel-min-lines-for-block-output 1
        org-confirm-babel-evaluate nil
        org-src-preserve-indentation t

        <span class="org-comment-delimiter">;; </span><span class="org-comment">Fontify</span>
        org-fontify-done-headline t
        org-src-fontify-natively t

        <span class="org-comment-delimiter">;; </span><span class="org-comment">Agenda</span>
        org-agenda-start-with-log-mode t
        org-log-done 'time
        org-agenda-skip-scheduled-if-done t
        org-log-into-drawer t
        org-agenda-files '(<span class="org-string">"~/org/work.org"</span> <span class="org-string">"~/org/keep.org"</span> <span class="org-string">"~/org/house.org"</span> <span class="org-string">"~/org/perso.org"</span>)

        org-agenda-custom-commands '((<span class="org-string">"R"</span> <span class="org-string">"Tasks that were completed more than 14 days ago."</span> tags <span class="org-string">"-REFILE/"</span>
               ((org-agenda-files '(<span class="org-string">"~/org/work.org"</span> <span class="org-string">"~/org/perso.org"</span> <span class="org-string">"~/org/house.org"</span>))
                (org-agenda-overriding-header <span class="org-string">"Archivable tasks"</span>)
                (org-agenda-skip-function '(zin/since-state 14 <span class="org-string">"\</span><span class="org-string"><span class="org-regexp-grouping-backslash">\</span></span><span class="org-string"><span class="org-warning"><span class="org-regexp-grouping-backslash">\</span></span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">DONE\</span><span class="org-string"><span class="org-regexp-grouping-backslash">\</span></span><span class="org-string"><span class="org-warning"><span class="org-regexp-grouping-backslash">\</span></span></span><span class="org-string"><span class="org-regexp-grouping-construct">|</span></span><span class="org-string">CANC\</span><span class="org-string"><span class="org-regexp-grouping-backslash">\</span></span><span class="org-string"><span class="org-warning"><span class="org-regexp-grouping-backslash">\</span></span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> t)))))



        <span class="org-comment-delimiter">;; </span><span class="org-comment">Refiling</span>
        org-refile-targets '((<span class="org-string">"~/org/archives.org"</span> <span class="org-builtin">:maxlevel</span> . 1)))

  (advice-add 'org-refile <span class="org-builtin">:after</span> 'org-save-all-org-buffers)

  (<span class="org-keyword">setq</span> org-todo-keywords
        '((sequence <span class="org-string">"TODO(t!)"</span> <span class="org-string">"|"</span> <span class="org-string">"DONE(d!)"</span>)))

  (<span class="org-keyword">setq</span> org-capture-templates
        '((<span class="org-string">"s"</span> <span class="org-string">"Site Entries"</span>)
          (<span class="org-string">"sr"</span> <span class="org-string">"Recipe"</span> plain
           (file (<span class="org-keyword">lambda</span> () (expand-file-name (read-string <span class="org-string">"Filename: "</span>) <span class="org-string">"~/dev/volnt.github.io/recipes/"</span>)))
           (file <span class="org-string">"~/org/templates/recipe.org"</span>))
          (<span class="org-string">"sn"</span> <span class="org-string">"Note"</span> plain
           (file (<span class="org-keyword">lambda</span> () (expand-file-name (read-string <span class="org-string">"Filename: "</span>) <span class="org-string">"~/dev/volnt.github.io/notes/"</span>))))
          (<span class="org-string">"t"</span> <span class="org-string">"Todo Entries"</span>)
          (<span class="org-string">"tt"</span> <span class="org-string">"Todo"</span> entry (file <span class="org-string">"~/org/perso.org"</span>)
           <span class="org-string">"* TODO %?\n%U\n%i"</span> <span class="org-builtin">:empty-lines</span> 1)
          (<span class="org-string">"th"</span> <span class="org-string">"House entry."</span> entry (file <span class="org-string">"~/org/house.org"</span>)
           <span class="org-string">"* TODO %? :house:\n%U\n%i"</span> <span class="org-builtin">:empty-lines</span> 1)
          (<span class="org-string">"tw"</span> <span class="org-string">"Work entry."</span> entry (file <span class="org-string">"~/org/work.org"</span>)
           <span class="org-string">"* TODO %? :work:\n%U\n%i"</span> <span class="org-builtin">:empty-lines</span> 1)
          (<span class="org-string">"m"</span> <span class="org-string">"Meeting Entries"</span>)
          (<span class="org-string">"mm"</span> <span class="org-string">"Meeting"</span> entry (file <span class="org-string">"~/org/perso.org"</span>)
           <span class="org-string">"* %? :meeting:\n%U\n%i"</span> <span class="org-builtin">:clock-in</span> <span class="org-builtin">:clock-resume</span> <span class="org-builtin">:empty-lines</span> 1)
          (<span class="org-string">"mw"</span> <span class="org-string">"Work Meeting"</span> entry (file <span class="org-string">"~/org/work.org"</span>)
           <span class="org-string">"* %? :work:meeting:\n%U\n%i"</span> <span class="org-builtin">:clock-in</span> <span class="org-builtin">:clock-resume</span> <span class="org-builtin">:empty-lines</span> 1)
          (<span class="org-string">"mo"</span> <span class="org-string">"One-to-One"</span> entry (file+headline <span class="org-string">"~/org/work.org"</span> <span class="org-string">"One-to-one"</span>)
           <span class="org-string">"* TODO %? :work:meeting:\n%U\n%i"</span> <span class="org-builtin">:clock-in</span> <span class="org-builtin">:clock-resume</span> <span class="org-builtin">:empty-lines</span> 1)
          (<span class="org-string">"mt"</span> <span class="org-string">"Tech Screening"</span> entry (file <span class="org-string">"~/org/work.org"</span>)
           (file <span class="org-string">"~/org/templates/tech-screening.org"</span>) <span class="org-builtin">:clock-in</span> <span class="org-builtin">:clock-resume</span> <span class="org-builtin">:empty-lines</span> 1)
          (<span class="org-string">"ml"</span> <span class="org-string">"ML Interview"</span> entry (file <span class="org-string">"~/org/work.org"</span>)
           (file <span class="org-string">"~/org/templates/ml-engineer-screening.org"</span>) <span class="org-builtin">:clock-in</span> <span class="org-builtin">:clock-resume</span> <span class="org-builtin">:empty-lines</span> 1)))

  (org-babel-do-load-languages
   'org-babel-load-languages '((python . t) (shell . t) (C . t) (gnuplot . t)))
  (use-package org-superstar
    <span class="org-builtin">:hook</span> (org-mode . org-superstar-mode)
    <span class="org-builtin">:custom</span>
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '(<span class="org-string">"&#9673;"</span> <span class="org-string">"&#9675;"</span> <span class="org-string">"&#9679;"</span> <span class="org-string">"&#9675;"</span> <span class="org-string">"&#9679;"</span> <span class="org-string">"&#9675;"</span> <span class="org-string">"&#9679;"</span>)))
  (use-package epresent)
  (use-package ox-jira)
  (straight-use-package '(org-contrib <span class="org-builtin">:includes</span> org-checklist))
  (load <span class="org-string">"org-checklist"</span>))
</pre>
</div>
</div>
</div>
