notes/emacs.org
** Install major modes
A few major modes I use.

#+begin_src elisp
;; Major modes

(use-package ledger-mode)
(use-package gnuplot
  :config
  (use-package gnuplot-mode))
(use-package lua-mode)
(use-package typescript-mode)
(use-package yaml-mode)
(use-package terraform-mode)
(use-package markdown-mode)
#+end_src

#+RESULTS:

** Theme
Setup the theme (color-theme + modeline).

#+begin_src elisp
;; Theme

(use-package solarized-theme
  :config (load-theme 'solarized-selenized-dark))

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :config
  (use-package all-the-icons)) ;; eval-expression (all-the-icons-install-fonts) on first run
#+end_src

** UI
All UI related packages.

Use ~vertico~ for minibuffer completion with ~marginalia~ for added details.

For code-completion use ~company~.

#+begin_src elisp
;; UI

(use-package unicode-fonts
  :config
  (unicode-fonts-setup)
  (use-package font-utils)
  (use-package ucs-utils))

(use-package flycheck
  :config (global-flycheck-mode))

(use-package vertico
  :init
  (vertico-mode)

  ;; Different scroll margin
  ;; (setq vertico-scroll-margin 0)

  ;; Show more candidates
  ;; (setq vertico-count 20)

  ;; Grow and shrink the Vertico minibuffer
  ;; (setq vertico-resize t)

  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  ;; (setq vertico-cycle t)
  )

;; Optionally use the `orderless' completion style. See
;; `+orderless-dispatch' in the Consult wiki for an advanced Orderless style
;; dispatcher. Additionally enable `partial-completion' for file path
;; expansion. `partial-completion' is important for wildcard support.
;; Multiple files can be opened at once with `find-file' if you enter a
;; wildcard. You may also give the `initials' completion style a try.
(use-package orderless
  :init
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init
  (savehist-mode))

;; A few more useful configurations...
(use-package emacs
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; Alternatively try `consult-completing-read-multiple'.
  (defun crm-indicator (args)
    (cons (concat "[CRM] " (car args)) (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t))

(use-package marginalia
  :config
  (marginalia-mode))

(use-package company
  :config
  (setq company-global-modes '(not shell-mode))
  (global-company-mode t)
  :bind (:map company-active-map ("<tab>" . company-complete-selection))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package highlight-indentation
  :straight (highlight-identation :type git :host github :repo "antonj/Highlight-Indentation-for-Emacs")
  :hook (prog-mode . highlight-indentation-mode)
  :config (setq highlight-indentation-blank-lines t))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package hl-line
  :config (global-hl-line-mode))

(use-package git-gutter
  :config (global-git-gutter-mode t))

(use-package helpful)
#+end_src

#+RESULTS:

** Utilities
Here are all utilities with no effect on UI.

#+begin_src elisp
;; Utilities

(use-package magit
  :bind (("C-c s" . magit-status)
         ("C-c b" . magit-blame)
         ("C-c g" . vc-git-grep)))

(use-package undo-tree
  :config (global-undo-tree-mode))

(use-package multiple-cursors
  :bind (("C-c m" . mc/mark-all-in-region)
         ("C-c n" . mc/mark-next-like-this)))

(use-package projectile
  :config (projectile-mode)
  :bind-keymap ("C-c p" . projectile-command-map))

(use-package autorevert)

(use-package which-key
  :config
  (which-key-mode))

(use-package eldoc)

(use-package realgud
  :config (load-library "realgud"))

(use-package yasnippet
  :config
  (yas-global-mode t)
  (use-package yasnippet-snippets))

(use-package gazr
  :straight (gazr :type git :host github :repo "volnt/gazr.el")
  :bind (("C-c C-g" . gazr)))
#+end_src

