notes/emacs.html

<div id="outline-container-org432ed17" class="outline-3">
<h3 id="org432ed17">Install major modes</h3>
<div class="outline-text-3" id="text-org432ed17">
<p>
A few major modes I use.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Major modes</span>

(use-package ledger-mode)
(use-package gnuplot
  <span class="org-builtin">:config</span>
  (use-package gnuplot-mode))
(use-package lua-mode)
(use-package typescript-mode)
(use-package yaml-mode)
(use-package terraform-mode)
(use-package markdown-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7e07c4a" class="outline-3">
<h3 id="org7e07c4a">Theme</h3>
<div class="outline-text-3" id="text-org7e07c4a">
<p>
Setup the theme (color-theme + modeline).
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Theme</span>

(use-package solarized-theme
  <span class="org-builtin">:config</span> (load-theme 'solarized-selenized-dark))

(use-package doom-modeline
  <span class="org-builtin">:init</span> (doom-modeline-mode 1)
  <span class="org-builtin">:config</span>
  (use-package all-the-icons)) <span class="org-comment-delimiter">;; </span><span class="org-comment">eval-expression (all-the-icons-install-fonts) on first run</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd95c04d" class="outline-3">
<h3 id="orgd95c04d">UI</h3>
<div class="outline-text-3" id="text-orgd95c04d">
<p>
All UI related packages.
</p>

<p>
Use <code>vertico</code> for minibuffer completion with <code>marginalia</code> for added details.
</p>

<p>
For code-completion use <code>company</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">UI</span>

(use-package unicode-fonts
  <span class="org-builtin">:config</span>
  (unicode-fonts-setup)
  (use-package font-utils)
  (use-package ucs-utils))

(use-package flycheck
  <span class="org-builtin">:config</span> (global-flycheck-mode))

(use-package vertico
  <span class="org-builtin">:init</span>
  (vertico-mode)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Different scroll margin</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq vertico-scroll-margin 0)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Show more candidates</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq vertico-count 20)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Grow and shrink the Vertico minibuffer</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq vertico-resize t)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Optionally enable cycling for `</span><span class="org-comment"><span class="org-constant">vertico-next</span></span><span class="org-comment">' and `</span><span class="org-comment"><span class="org-constant">vertico-previous</span></span><span class="org-comment">'.</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq vertico-cycle t)</span>
  )

<span class="org-comment-delimiter">;; </span><span class="org-comment">Optionally use the `</span><span class="org-comment"><span class="org-constant">orderless</span></span><span class="org-comment">' completion style. See</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">`</span><span class="org-comment"><span class="org-constant">+orderless-dispatch</span></span><span class="org-comment">' in the Consult wiki for an advanced Orderless style</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">dispatcher. Additionally enable `</span><span class="org-comment"><span class="org-constant">partial-completion</span></span><span class="org-comment">' for file path</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">expansion. `</span><span class="org-comment"><span class="org-constant">partial-completion</span></span><span class="org-comment">' is important for wildcard support.</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">Multiple files can be opened at once with `</span><span class="org-comment"><span class="org-constant">find-file</span></span><span class="org-comment">' if you enter a</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">wildcard. You may also give the `</span><span class="org-comment"><span class="org-constant">initials</span></span><span class="org-comment">' completion style a try.</span>
(use-package orderless
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Configure a custom style dispatcher (see the Consult wiki)</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq orderless-style-dispatchers '(+orderless-dispatch)</span>
  <span class="org-comment-delimiter">;;       </span><span class="org-comment">orderless-component-separator #'orderless-escapable-split-on-space)</span>
  (<span class="org-keyword">setq</span> completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Persist history over Emacs restarts. Vertico sorts by history position.</span>
(use-package savehist
  <span class="org-builtin">:init</span>
  (savehist-mode))

<span class="org-comment-delimiter">;; </span><span class="org-comment">A few more useful configurations...</span>
(use-package emacs
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add prompt indicator to `</span><span class="org-comment"><span class="org-constant">completing-read-multiple</span></span><span class="org-comment">'.</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Alternatively try `</span><span class="org-comment"><span class="org-constant">consult-completing-read-multiple</span></span><span class="org-comment">'.</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">crm-indicator</span> (args)
    (cons (concat <span class="org-string">"[CRM] "</span> (car args)) (cdr args)))
  (advice-add #'completing-read-multiple <span class="org-builtin">:filter-args</span> #'crm-indicator)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Do not allow the cursor in the minibuffer prompt</span>
  (<span class="org-keyword">setq</span> minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Emacs 28: Hide commands in M-x which do not work in the current mode.</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Vertico commands are hidden in normal buffers.</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(setq read-extended-command-predicate</span>
  <span class="org-comment-delimiter">;;       </span><span class="org-comment">#'command-completion-default-include-p)</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Enable recursive minibuffers</span>
  (<span class="org-keyword">setq</span> enable-recursive-minibuffers t))

(use-package marginalia
  <span class="org-builtin">:config</span>
  (marginalia-mode))

(use-package company
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> company-global-modes '(not shell-mode))
  (global-company-mode t)
  <span class="org-builtin">:bind</span> (<span class="org-builtin">:map</span> company-active-map (<span class="org-string">"&lt;tab&gt;"</span> . company-complete-selection))
  <span class="org-builtin">:custom</span>
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package highlight-indentation
  <span class="org-builtin">:straight</span> (highlight-identation <span class="org-builtin">:type</span> git <span class="org-builtin">:host</span> github <span class="org-builtin">:repo</span> <span class="org-string">"antonj/Highlight-Indentation-for-Emacs"</span>)
  <span class="org-builtin">:hook</span> (prog-mode . highlight-indentation-mode)
  <span class="org-builtin">:config</span> (<span class="org-keyword">setq</span> highlight-indentation-blank-lines t))

(use-package rainbow-delimiters
  <span class="org-builtin">:hook</span> (prog-mode . rainbow-delimiters-mode))

(use-package hl-line
  <span class="org-builtin">:config</span> (global-hl-line-mode))

(use-package git-gutter
  <span class="org-builtin">:config</span> (global-git-gutter-mode t))

(use-package helpful)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8c651b" class="outline-3">
<h3 id="orgd8c651b">Utilities</h3>
<div class="outline-text-3" id="text-orgd8c651b">
<p>
Here are all utilities with no effect on UI.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Utilities</span>

(use-package magit
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c s"</span> . magit-status)
         (<span class="org-string">"C-c b"</span> . magit-blame)
         (<span class="org-string">"C-c g"</span> . vc-git-grep)))

(use-package undo-tree
  <span class="org-builtin">:config</span> (global-undo-tree-mode))

(use-package multiple-cursors
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c m"</span> . mc/mark-all-in-region)
         (<span class="org-string">"C-c n"</span> . mc/mark-next-like-this)))

(use-package projectile
  <span class="org-builtin">:config</span> (projectile-mode)
  <span class="org-builtin">:bind-keymap</span> (<span class="org-string">"C-c p"</span> . projectile-command-map))

(use-package autorevert)

(use-package which-key
  <span class="org-builtin">:config</span>
  (which-key-mode))

(use-package eldoc)

(use-package realgud
  <span class="org-builtin">:config</span> (load-library <span class="org-string">"realgud"</span>))

(use-package yasnippet
  <span class="org-builtin">:config</span>
  (yas-global-mode t)
  (use-package yasnippet-snippets))

(use-package gazr
  <span class="org-builtin">:straight</span> (gazr <span class="org-builtin">:type</span> git <span class="org-builtin">:host</span> github <span class="org-builtin">:repo</span> <span class="org-string">"volnt/gazr.el"</span>)
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c C-g"</span> . gazr)))
</pre>
</div>
</div>
