notes/emacs.org
*** Vterm
Emacs-libvterm (vterm) is fully-fledged terminal emulator inside GNU Emacs based on libvterm, a C library. As a result of using compiled code (instead of elisp), emacs-libvterm is fully capable, fast, and it can seamlessly handle large outputs.

#+begin_src elisp

(use-package vterm
  :config
  (setq vterm-max-scrollback 100000))

#+end_src

** Python setup
Because Python is the language I use the most, I use more packages than just the major-mode.

~blacken~ is used for code formatting, and ~py-isort~ for imports ordering.

~lsp-pyright~ is used for code completion, flycheck warnings and ~find-definitions~ / ~find-references~.

#+begin_src elisp
;; Python

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :config
  (lsp-enable-which-key-integration t)
  (use-package lsp-ui)
  (use-package lsp-treemacs))

(use-package py-isort
  :custom (py-isort-options '("-w 120"))
  :hook (before-save . py-isort-before-save))

(use-package blacken
  :hook (python-mode . blacken-mode)
  :custom (blacken-line-length 120))

(use-package lsp-pyright
  :hook (python-mode . (lambda ()
                         (require 'lsp-pyright)
                         (lsp)))  ; or lsp-deferred
  :init (setq lsp-pyright-python-executable-cmd "python3.8")
  :config (setq lsp-pyright-disable-organize-imports t)
  :bind-keymap ("C-c C-o" . lsp-command-map)
  :bind (("C-c ;" . xref-find-definitions)
         ("C-c ," . xref-pop-marker-stack)
         ("C-c :" . lsp-find-references)))
#+end_src

#+RESULTS:
#+begin_example
lsp-find-references
#+end_example
