notes/emacs.html

<div id="outline-container-org298c393" class="outline-4">
<h4 id="org298c393">Vterm</h4>
<div class="outline-text-4" id="text-org298c393">
<p>
Emacs-libvterm (vterm) is fully-fledged terminal emulator inside GNU Emacs based on libvterm, a C library. As a result of using compiled code (instead of elisp), emacs-libvterm is fully capable, fast, and it can seamlessly handle large outputs.
</p>

<div class="org-src-container">
<pre class="src src-elisp">
(use-package vterm
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">setq</span> vterm-max-scrollback 100000))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbc6e22c" class="outline-3">
<h3 id="orgbc6e22c">Python setup</h3>
<div class="outline-text-3" id="text-orgbc6e22c">
<p>
Because Python is the language I use the most, I use more packages than just the major-mode.
</p>

<p>
<code>blacken</code> is used for code formatting, and <code>py-isort</code> for imports ordering.
</p>

<p>
<code>lsp-pyright</code> is used for code completion, flycheck warnings and <code>find-definitions</code> / <code>find-references</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Python</span>

(use-package lsp-mode
  <span class="org-builtin">:commands</span> (lsp lsp-deferred)
  <span class="org-builtin">:config</span>
  (lsp-enable-which-key-integration t)
  (use-package lsp-ui)
  (use-package lsp-treemacs))

(use-package py-isort
  <span class="org-builtin">:custom</span> (py-isort-options '(<span class="org-string">"-w 120"</span>))
  <span class="org-builtin">:hook</span> (before-save . py-isort-before-save))

(use-package blacken
  <span class="org-builtin">:hook</span> (python-mode . blacken-mode)
  <span class="org-builtin">:custom</span> (blacken-line-length 120))

(use-package lsp-pyright
  <span class="org-builtin">:hook</span> (python-mode . (<span class="org-keyword">lambda</span> ()
                         (<span class="org-keyword">require</span> '<span class="org-constant">lsp-pyright</span>)
                         (lsp)))  <span class="org-comment-delimiter">; </span><span class="org-comment">or lsp-deferred</span>
  <span class="org-builtin">:init</span> (<span class="org-keyword">setq</span> lsp-pyright-python-executable-cmd <span class="org-string">"python3.8"</span>)
  <span class="org-builtin">:config</span> (<span class="org-keyword">setq</span> lsp-pyright-disable-organize-imports t)
  <span class="org-builtin">:bind-keymap</span> (<span class="org-string">"C-c C-o"</span> . lsp-command-map)
  <span class="org-builtin">:bind</span> ((<span class="org-string">"C-c ;"</span> . xref-find-definitions)
         (<span class="org-string">"C-c ,"</span> . xref-pop-marker-stack)
         (<span class="org-string">"C-c :"</span> . lsp-find-references)))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-03-28 Mon 13:38</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
